[
  {
    "id": 1,
    "Title": "React.js Developer - HTML/CSS/Javascript",
    "Company": "Deqode",
    "Location": "Mumbai Metropolitan Region",
    "Link": "https://in.linkedin.com/jobs/view/react-js-developer-html-css-javascript-at-deqode-4211058310?position=3&pageNum=0&refId=eDm74R%2FphOxzx1Og5Bg3%2Fw%3D%3D&trackingId=MUQ7dv9jVjC0WShFQkMXkw%3D%3D",
    "Posted": "1 week ago",
    "DateTime": "2025-04-16",
    "Details": {
      "Description": "Profile : Senior React.js DeveloperLocation : Mumbai (Andheri East)Work mode : full-time role (5 days in-office)Experience : 3 years of frontend excellence.The Role Complete frontend application development and delivery Creating high-performance experiences across mobile and desktop Writing clean, tested JavaScript, HTML, and CSS Collaborating with designers and backend developersRequired Skills 3+ years of experience in ReactJS Experience with build tools like Webpack/Gulp/Grunt Proficiency with CSS preprocessors (SASS/LESS) Creating reusable, testable components Node.js experience (major plus for our ecosystem!) Understanding of platform architecture, APIs, caching, proxies Obsession with clean, organized code(ref:hirist.tech)",
      "Responsibilities": [],
      "Skills": [
        "3+ years of experience in ReactJS Experience with build tools like Webpack/Gulp/Grunt Proficiency with CSS preprocessors (SASS/LESS) Creating reusable, testable components Node.js experience (major plus for our ecosystem!) Understanding of platform architecture, APIs, caching, proxies Obsession with clean, organized code"
      ],
      "ApplyLink": "https://in.linkedin.com/jobs/view/react-js-developer-html-css-javascript-at-deqode-4211058310?position=3&pageNum=0&refId=eDm74R%2FphOxzx1Og5Bg3%2Fw%3D%3D&trackingId=MUQ7dv9jVjC0WShFQkMXkw%3D%3D"
    }
  },
  {
    "id": 2,
    "Title": "Frontend Developer",
    "Company": "Wissen Technology",
    "Location": "Mumbai, Maharashtra, India",
    "Link": "https://in.linkedin.com/jobs/view/frontend-developer-at-wissen-technology-4207765766?position=9&pageNum=0&refId=eDm74R%2FphOxzx1Og5Bg3%2Fw%3D%3D&trackingId=axOOOc3utetFs7oylKZaaw%3D%3D",
    "Posted": "1 week ago",
    "DateTime": "2025-04-11",
    "Details": {
      "Description": "Job Description As an Angular UI, you will be responsible for designing, implementing, and maintaining our applications UI as well as infrastructure and CI/CD pipelines. You will work closely with our development, operations.Responsibilities:Application Development: Design, develop, and maintain scalable and maintainable software applications using Angular 19. Collaboration: Work closely with cross-functional teams, including backend developers, designers, and system administrators, to ensure seamless integration and delivery. Performance Optimization: Ensure high performance and responsiveness of applications across various devices and platforms. Code Quality: Write clean, efficient, and well-documented code; conduct code reviews to maintain quality standards. Continuous Improvement: Stay updated with the latest industry trends and technologies to continuously improve development processes and application performance. Requirements:Experience: 5 to 9 years of professional experience in software development, with a strong focus on Angular 19 and DevOps practices.Technical Skills: Proficiency in Angular 19, HTML5, CSS3, JavaScript, and TypeScript. Knowledge of RESTful APIs and web services. Soft Skills: Strong problem-solving abilities and analytical skills. Excellent communication and teamwork skills. Ability to work in an Agile development environment. Preferred Qualifications: Experience with additional front-end frameworks or libraries (e.g., React, Vue.js). Certifications in DevOps or cloud technologies. Experience with automated testing frameworks and tools Familiarity with cloud platforms such as Azure, AWS, or Google Cloud.",
      "Responsibilities": [],
      "Skills": [],
      "ApplyLink": "https://in.linkedin.com/jobs/view/frontend-developer-at-wissen-technology-4207765766?position=9&pageNum=0&refId=eDm74R%2FphOxzx1Og5Bg3%2Fw%3D%3D&trackingId=axOOOc3utetFs7oylKZaaw%3D%3D"
    }
  },
  {
    "id": 3,
    "Title": "Frontend Developer - HTML5/CSS3/Javascript",
    "Company": "Sampoorna Consultants",
    "Location": "Mumbai, Maharashtra, India",
    "Link": "https://in.linkedin.com/jobs/view/frontend-developer-html5-css3-javascript-at-sampoorna-consultants-4198611639?position=15&pageNum=0&refId=eDm74R%2FphOxzx1Og5Bg3%2Fw%3D%3D&trackingId=r2Kzxs0vLV76JFHnWZkTkw%3D%3D",
    "Posted": "3 weeks ago",
    "DateTime": "2025-04-02",
    "Details": {
      "Description": "Front-End Developer , you`ll play a critical role in shaping the user interface and experience for our growing platform. You will collaborate closely with our backend developers, UX/UI designers, and graphic designers to create responsive, high-performance web and mobile applications. You'll ensure the platform not only looks and feels exceptional but also performs seamlessly across all devices.Job Role Design and implement web interfaces that enhance user experience. Collaborate closely with UX/UI designers to translate designs into high-quality code, maintaining graphic standards and brand consistency. Work with backend developers to ensure smooth integration between front-end and back-end components. Evaluate and adopt emerging front-end technologies, staying at the cutting edge of web development trends. Advocate for web accessibility standards and ensure compliance throughout the development process. Troubleshoot and resolve technical issues, ensuring a smooth and reliable user experience. Contribute to the development and maintenance of coding standards and best practices. Continuously work on improving development processes to enhance team efficiency.Qualifications 4+ years of professional experience in front-end development. Expertise in JavaScript, HTML5, CSS3, and front-end frameworks (Angular, React, or Vue.js). Experience with modern UI libraries and design tools (e.g., Figma, Sketch, Adobe XD). In-depth knowledge of web accessibility standards and best practices. Familiarity with RESTful APIs and integrating front-end components with backend services. Strong knowledge of version control systems (Git) and CI/CD pipelines. Bachelor`s degree in Computer Science, Design, or related field, or equivalent experience. Bonus: Experience with health tech or AI-driven platforms.Job Type : Permanent WFH(ref:hirist.tech)",
      "Responsibilities": [],
      "Skills": [],
      "ApplyLink": "https://in.linkedin.com/jobs/view/frontend-developer-html5-css3-javascript-at-sampoorna-consultants-4198611639?position=15&pageNum=0&refId=eDm74R%2FphOxzx1Og5Bg3%2Fw%3D%3D&trackingId=r2Kzxs0vLV76JFHnWZkTkw%3D%3D"
    }
  },
  {
    "id": 4,
    "Title": "React Developer",
    "Company": "Arcitech",
    "Location": "Mumbai, Maharashtra, India",
    "Link": "https://in.linkedin.com/jobs/view/react-developer-at-arcitech-4214939694?position=18&pageNum=0&refId=eDm74R%2FphOxzx1Og5Bg3%2Fw%3D%3D&trackingId=fNeyIzLCwrvVMPllOXg%2FSg%3D%3D",
    "Posted": "7 hours ago",
    "DateTime": "2025-04-24",
    "Details": {
      "Description": "Role OverviewAs a React Developer at Arcitech AI, you will play a crucial role in driving our advancements in the software and IT sector. You will be tasked with developing cutting-edge solutions in software development, website creation, mobile app innovation, and AI integrative technologies. This role presents exciting challenges and opportunities for professional growth in a dynamic and innovative environment.ResponsibilitiesDevelop and optimize performance of React componentsTroubleshoot bugs and implement solutionsUtilize technologies such as Redux, Websockets, and TypescriptCollaborate with the team to integrate APIs and enhance user experienceImplement state management and frontend development best practicesQualificationsBachelor's degree in Computer Science or related fieldMinimum of 2 to 3 years of experience in React developmentSkillsProficiency in React, Redux, Websockets, and TypescriptStrong understanding of HTML5, CSS3, and CSS preprocessors like SASS/LESSExperience with webpack, npm, and babelFamiliarity with material-ui integration and unit testingAbility to work with state management and React hooksOther DetailsJoin our dynamic team at Arcitech AI, located in Mumbai. Enjoy a friendly and cooperative company culture with weekends off and provident fund benefits. Take advantage of opportunities for professional growth and a competitive benefits package. At Arcitech AI, we're not just shaping the future; we're defining it.",
      "Responsibilities": [
        "Develop and optimize performance of React componentsTroubleshoot bugs and implement solutionsUtilize technologies such as Redux, Websockets, and TypescriptCollaborate with the team to integrate APIs and enhance user experienceImplement state management and frontend development best practices"
      ],
      "Skills": [
        "Proficiency in React, Redux, Websockets, and TypescriptStrong understanding of HTML5, CSS3, and CSS preprocessors like SASS/LESSExperience with webpack, npm, and babelFamiliarity with material-ui integration and unit testingAbility to work with state management and React hooks"
      ],
      "ApplyLink": "https://in.linkedin.com/jobs/view/react-developer-at-arcitech-4214939694?position=18&pageNum=0&refId=eDm74R%2FphOxzx1Og5Bg3%2Fw%3D%3D&trackingId=fNeyIzLCwrvVMPllOXg%2FSg%3D%3D"
    }
  },
  {
    "id": 5,
    "Title": "Frontend Developer",
    "Company": "Fulfillment IQ",
    "Location": "Mumbai, Maharashtra, India",
    "Link": "https://in.linkedin.com/jobs/view/frontend-developer-at-fulfillment-iq-4200275153?position=24&pageNum=0&refId=eDm74R%2FphOxzx1Og5Bg3%2Fw%3D%3D&trackingId=bKwXiQM%2FfVKKJlZ9o0grRw%3D%3D",
    "Posted": "3 weeks ago",
    "DateTime": "2025-04-03",
    "Details": {
      "Description": "GENERAL INFORMATIONRole Title: Frontend DeveloperJob Type: Full timeLocation: Toronto, ON (Remote)About FulfillmentIQ (FIQ)At FulfillmentIQ, we’re disruptors in the supply chain and logistics sector. As an award-winning supply chain tech company, we design and deliver cutting-edge solutions for D2C brands, retailers, and 3PLs. Our teams thrive on solving complex logistics challenges, from developing custom software and advising on tech stack selection to implementing advanced supply chain technology.If you’re passionate about problem-solving, thrive in dynamic environments, and want to make an impact, we’d love to have you on board.The UI Magician!Do you eat, sleep, and breathe JavaScript?Can you transform a dull UI into an interactive masterpiece?Ready to shape the future of web experiences?If your answer is a resounding \"YES!\"—then welcome to the front lines of our web experience! As a Frontend Developer, you’ll play a pivotal role in crafting beautiful, seamless, and intuitive user interfaces that captivate our users. Your work will bridge the gap between design and technology, ensuring a delightful user experience that feels effortless.Core Responsibilities Writing beautiful, efficient, and scalable frontend code that follows best practices. Crafting smooth, high-performance UI interactions that feel natural and engaging. Collaborating closely with UX/UI designers to bring wireframes and concepts to life. Ensuring responsiveness across all devices, from desktops to mobile screens. Debugging & optimizing performance—because no one likes a laggy app! Implementing modern frontend frameworks (React, Vue, Angular) to create dynamic, reusable components. Staying ahead of frontend trends and incorporating the latest best practices in web development. Championing accessibility & usability to make sure everyone can enjoy our applications.Experience And Qualifications 5+ years of experience working with modern frontend frameworks (React, Vue, or Angular). Expertise in JavaScript (ES6+), TypeScript, HTML5, and CSS3. A deep love for CSS animations, transitions, and responsive designs. Experience with state management tools (Redux, Vuex, Context API, etc.). Familiarity with UI component libraries (Material UI, Tailwind CSS, Bootstrap, etc.). A passion for creating intuitive, stunning, and accessible user interfaces. Strong debugging and troubleshooting skills—because bugs don’t belong in production! Experience with performance optimization (lazy loading, caching, bundling). Familiarity with RESTful APIs & GraphQL, ensuring seamless frontend-backend integration. Version control knowledge (Git, GitHub, GitLab).Bonus Points If You Have Experience with Next.js or Nuxt.js for server-side rendering. Knowledge of Webpack, Vite, or other build tools to optimize assets. Understanding of UI/UX principles & usability testing. Basic familiarity with backend technologies (Node.js, Firebase, etc.). Experience with testing frameworks (Jest, Cypress, Testing Library).Why You’ll Love Working Here Innovative Environment: We are at the forefront of [insert relevant field] innovation, providing you with opportunities to work on cutting-edge projects that have a global impact. Career Growth: We believe in your potential and offer numerous training and development programs to accelerate your career growth. Work-Life Balance: We offer flexible working hours, hybrid/remote work options, and a focus on wellness to ensure our team members maintain a healthy balance. Diversity & Inclusion: We are committed to creating an inclusive work environment where diverse voices are not just heard but empowered. Collaborative Culture: Work with a supportive and talented team, where every opinion is valued, and success is celebrated collectively. Corporate events: Annual gathering for gelling up with team from diverse city/state/country with sight-seeing and lot more engagement activity and thrill.Perks you’ll appreciate Comprehensive health insurance for you and your family Generous paid time off, including vacation, holidays, and sick leave Flexible work schedules Employee wellness program Business/client travel, internet, and workstation reimbursements Sponsored U.S. visa opportunities (based on performance and project needs) Anniversary rewards (Amazon or Sodexo vouchers) Employee stock options (ESOP) Retirement savings planFIQ CultureFulfillment IQ is a company that values its people, and we work together as a team while being a remote company. Fulfillment IQ is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees.To Know More About Jump On The Links BelowWebsite: https://fulfillmentiq.com/LinkedIn Page: https://www.linkedin.com/company/fulfillmentiq/about/Hear us on: https://open.spotify.com/show/1IA3mhyXavWviPuQ6fb0DoSubscribe to us on: https://www.youtube.com/playlist?list=PLJQYvEuiLIKFzdXkW3aZGV3nPUB8EN FAa",
      "Responsibilities": [],
      "Skills": [],
      "ApplyLink": "https://in.linkedin.com/jobs/view/frontend-developer-at-fulfillment-iq-4200275153?position=24&pageNum=0&refId=eDm74R%2FphOxzx1Og5Bg3%2Fw%3D%3D&trackingId=bKwXiQM%2FfVKKJlZ9o0grRw%3D%3D"
    }
  },
  {
    "id": 6,
    "Title": "ReactJS Developer",
    "Company": "Deqode",
    "Location": "Mumbai Metropolitan Region",
    "Link": "https://in.linkedin.com/jobs/view/reactjs-developer-at-deqode-4206704448?position=27&pageNum=0&refId=eDm74R%2FphOxzx1Og5Bg3%2Fw%3D%3D&trackingId=8DE6mvE9Bg71RYYZH3ZIig%3D%3D",
    "Posted": "1 week ago",
    "DateTime": "2025-04-12",
    "Details": {
      "Description": "About DeqodeAt Deqode, we work on cutting-edge solutions that are redefining the digital frontier. Our team thrives on innovation, collaboration, and creating next-gen products that solve real-world problems. We are now looking for a skilled and passionate React.js Developer to join our growing frontend team.Roles & ResponsibilitiesTake complete ownership and delivery of front-end applications.Ensure optimized performance across mobile and desktop platforms.Write clean, tested, and well-documented code using JavaScript, HTML, and CSS.Collaborate with UI/UX designers, HTML coders, and backend developers to bring designs to life.Integrate RESTful APIs and work seamlessly with backend teams.Communicate and integrate with third-party web services.Build and manage infrastructure for serving frontend apps and assets.Maintain frontend application deployment and ensure build pipeline automation.Use JSDoc or similar tools for inline documentation of code.Write extensive unit tests following Test-Driven Development (TDD) best practices.Design and automate the frontend build process using tools like Webpack/Gulp/Grunt.Required Skills & Qualifications3+ years of experience developing production-level web applications.Strong command over React.js or Vue.js, JavaScript, HTML5, CSS3.Deep understanding of DOM APIs, native JavaScript, and popular libraries.Proficiency in CSS preprocessors (SASS/LESS) and modular CSS (CSS Modules).Familiarity with build tools like Webpack, Gulp, or Grunt.Experience creating modular, self-contained, and reusable components.Strong understanding of cross-browser compatibility and performance optimizations.Clean, organized, and maintainable code practices.Bonus: Working knowledge of Node.js and backend concepts like APIs, databases, caching layers, and proxies.Comfort in implementing pixel-perfect designs, animations, and smooth transitions.Excellent communication and teamwork skills.A proactive mindset with the ability to work both independently and in a team.Skills:- React.js, HTML/CSS, Javascript and DOM",
      "Responsibilities": [
        "Take complete ownership and delivery of front-end applications.Ensure optimized performance across mobile and desktop platforms.Write clean, tested, and well-documented code using JavaScript, HTML, and CSS.Collaborate with UI/UX designers, HTML coders, and backend developers to bring designs to life.Integrate RESTful APIs and work seamlessly with backend teams.Communicate and integrate with third-party web services.Build and manage infrastructure for serving frontend apps and assets.Maintain frontend application deployment and ensure build pipeline automation.Use JSDoc or similar tools for inline documentation of code.Write extensive unit tests following Test-Driven Development (TDD) best practices.Design and automate the frontend build process using tools like Webpack/Gulp/Grunt."
      ],
      "Skills": [
        "3+ years of experience developing production-level web applications.Strong command over React.js or Vue.js, JavaScript, HTML5, CSS3.Deep understanding of DOM APIs, native JavaScript, and popular libraries.Proficiency in CSS preprocessors (SASS/LESS) and modular CSS (CSS Modules).Familiarity with build tools like Webpack, Gulp, or Grunt.Experience creating modular, self-contained, and reusable components.Strong understanding of cross-browser compatibility and performance optimizations.Clean, organized, and maintainable code practices.Bonus: Working knowledge of Node.js and backend concepts like APIs, databases, caching layers, and proxies.Comfort in implementing pixel-perfect designs, animations, and smooth transitions.Excellent communication and teamwork skills.A proactive mindset with the ability to work both independently and in a team."
      ],
      "ApplyLink": "https://in.linkedin.com/jobs/view/reactjs-developer-at-deqode-4206704448?position=27&pageNum=0&refId=eDm74R%2FphOxzx1Og5Bg3%2Fw%3D%3D&trackingId=8DE6mvE9Bg71RYYZH3ZIig%3D%3D"
    }
  },
  {
    "id": 7,
    "Title": "Frontend React Developer",
    "Company": "Brainwonders",
    "Location": "Mumbai, Maharashtra, India",
    "Link": "https://in.linkedin.com/jobs/view/frontend-react-developer-at-brainwonders-4215320573?position=28&pageNum=0&refId=eDm74R%2FphOxzx1Og5Bg3%2Fw%3D%3D&trackingId=fiX9zJF1jYA0NyNbopm3zQ%3D%3D",
    "Posted": "1 day ago",
    "DateTime": "2025-04-23",
    "Details": {
      "Description": "Company DescriptionCompany DescriptionBrainwondersAt Brainwonders, we are proud to be India’s largest career counselling and guidance company, recognized for our commitment to transforming students' futures. With 1223+ educational institutes using our services, 93+ corporate connections, and 108+ franchisees, we have built an expansive network of support for students, educators, and professionals. Brainwonders has earned numerous national and regional awards for excellence in career counselling and guidance, and is consistently rated as one of the highest-paying employers in the counselling industry by various job portals.Job DescriptionTitle : Frontend React Developer (Reactjs/ Nextjs + Node js)Responsibilities: Building engaging, quirky, fast front ends using frameworks like React / Nextjs.  Design, program and update software Web Applications, Web Sites, and User Interfaces.  Recommend improvements to ensure software reliability and uptime, ensuring an equitable experience for users implementing code that runs great across platforms.  Monitoring apps to make sure they are available to users Building well structured and documented APIs so that our apps can interoperate with ease Frequently and confidently shipping application improvements Analyze user requirements and convert requirements to design documents Clearly and regularly communicate with management and technical colleagues Participate in agile sprints with cross functional teams including planning, daily standups, backlog grooming sessions and reviews Make SEO friendly Web Applications.  Proactively identify opportunities and deliver improvements; following agile methodology.  Creating highly scalable backend, load tested and ready to deploy on the cloud Analyzing performance and squashing tricky bugs using tools like DataDog or AWS CloudWatch Skills required: 3-4 years of professional software development experience 3+ years’ experience with a modern JavaScript framework (preferably React/Redux) JavaScript, Reacts with Redux.  Strong Computer Science and Software Engineering fundamentals (SDLC, Data Structures and Algorithms, Computer programming, Programming languages) Ability to write code expertly in JavaScript and at least one other dissimilar language Strong proven communication skills in writing and conversation Understanding of good software design and modern software engineering practices Problem-solving mindset Passion for building software applications Experience with Typescript Experience with server-side development preferably in Node.js Building: Linux, Jenkins, Docker, SCSS, Webpack Storage: Postgres, S3 Deployment: AWS (EC2, Lambda, SQS, etc.), Datadog Experience in the Education industry or educational technology Additional InformationOffice Timings(onsite)Monday to Saturday: 10 am to 7 pmSalary: 25,000-45,000Industry type: Education Industry.Only candidates from Mumbai and nearby shall apply*",
      "Responsibilities": [
        "Building engaging, quirky, fast front ends using frameworks like React / Nextjs.  Design, program and update software Web Applications, Web Sites, and User Interfaces.  Recommend improvements to ensure software reliability and uptime, ensuring an equitable experience for users implementing code that runs great across platforms.  Monitoring apps to make sure they are available to users Building well structured and documented APIs so that our apps can interoperate with ease Frequently and confidently shipping application improvements Analyze user requirements and convert requirements to design documents Clearly and regularly communicate with management and technical colleagues Participate in agile sprints with cross functional teams including planning, daily standups, backlog grooming sessions and reviews Make SEO friendly Web Applications.  Proactively identify opportunities and deliver improvements; following agile methodology.  Creating highly scalable backend, load tested and ready to deploy on the cloud Analyzing performance and squashing tricky bugs using tools like DataDog or AWS CloudWatch"
      ],
      "Skills": [
        "3-4 years of professional software development experience 3+ years’ experience with a modern JavaScript framework (preferably React/Redux) JavaScript, Reacts with Redux.  Strong Computer Science and Software Engineering fundamentals (SDLC, Data Structures and Algorithms, Computer programming, Programming languages) Ability to write code expertly in JavaScript and at least one other dissimilar language Strong proven communication skills in writing and conversation Understanding of good software design and modern software engineering practices Problem-solving mindset Passion for building software applications Experience with Typescript Experience with server-side development preferably in Node.js Building: Linux, Jenkins, Docker, SCSS, Webpack Storage: Postgres, S3 Deployment: AWS (EC2, Lambda, SQS, etc.), Datadog Experience in the Education industry or educational technology Additional Information"
      ],
      "ApplyLink": "https://in.linkedin.com/jobs/view/frontend-react-developer-at-brainwonders-4215320573?position=28&pageNum=0&refId=eDm74R%2FphOxzx1Og5Bg3%2Fw%3D%3D&trackingId=fiX9zJF1jYA0NyNbopm3zQ%3D%3D"
    }
  },
  {
    "id": 8,
    "Title": "React JS Developer",
    "Company": "Tata Consultancy Services",
    "Location": "Mumbai, Maharashtra, India",
    "Link": "https://in.linkedin.com/jobs/view/react-js-developer-at-tata-consultancy-services-4204806672?position=39&pageNum=0&refId=eDm74R%2FphOxzx1Og5Bg3%2Fw%3D%3D&trackingId=FrnMVszyhEx5gsbgbyqiOA%3D%3D",
    "Posted": "2 weeks ago",
    "DateTime": "2025-04-09",
    "Details": {
      "Description": "Greetings from TATA CONSULTANCY SERVICES LIMITED!!!We are looking for React JS Developer.Required Technical Skill Set: React JS, HTML, CSSLocation: Bangalore, MumbaiExperience Range: 6-8 yrsResponsibilities1. Expert level knowledge in React JS, React Hooks, Redux, Redux middleware's, Unit testing frameworks, ES6, CSS, CSS preprocessors, HTML, Webpack.2. Solid knowledge in HTML/CSS/JavaScript3. Must have good communication skill. Able to explain and articulate challenges effectively4. Must be motivated to learn and adopt the technology used in applicationsInterested candidates please share your resume to nirubashree.v@tcs.com along with below details1. Total years of Exp:2. Email ID:3. Present Company:4. Current Location:5. Mobile No:6. Current CTC:7. Expected CTC:8. Notice Period:9. No of Gaps (If any):10. Highest Qualification (Full time/ Part time):11.You will be available on Saturday for Virtual Interview (Yes / No):",
      "Responsibilities": [],
      "Skills": [],
      "ApplyLink": "https://in.linkedin.com/jobs/view/react-js-developer-at-tata-consultancy-services-4204806672?position=39&pageNum=0&refId=eDm74R%2FphOxzx1Og5Bg3%2Fw%3D%3D&trackingId=FrnMVszyhEx5gsbgbyqiOA%3D%3D"
    }
  },
  {
    "id": 9,
    "Title": "React Developer",
    "Company": "Recro",
    "Location": "Mumbai, Maharashtra, India",
    "Link": "https://in.linkedin.com/jobs/view/react-developer-at-recro-4214197550?position=43&pageNum=0&refId=eDm74R%2FphOxzx1Og5Bg3%2Fw%3D%3D&trackingId=gWby7eGuILIQcirRlJfmgQ%3D%3D",
    "Posted": "1 day ago",
    "DateTime": "2025-04-23",
    "Details": {
      "Description": "Experience: 2-3 YOE ONLY. Company exposure: Product based experience only.Location: Mumbai, 5 days/weekNotice Period: Immediate joiners. DON'T APPLY IF NOT SERVING!Job Brief:We are looking for a rockstar JavaScript developer who is proficient with Javascript Frameworks. Your primary focus will be on developing user interface components and implementing them following well-known React.js workflows (such as Flux or Redux).You will ensure that these components and the overall application are robust and easy to maintain. You will coordinate with the rest of the team working on different layers of the infrastructure. Therefore, a commitment to collaborative problem solving, sophisticated design, and quality products are important.Technical Skills:● Proficient in React.JS framework.● We work with React+Next so knowledge of these is mandatory.● Experience working with modern Javascript libraries and tools like ES6/ES7, andWebpack.● Experience with unit testing in any modern javascript library. (Jest/Mocha/Jasmine)● Keeps an eye on new front-end ecosystem changes.● Knowledge of TypeScript and node js (Relay+Graph ql) would be a plus.● Proficient in HTML & CSS.● Sense for appeal & aesthetics from a usability perspective.Soft Skills:● Obsessed with best practices and have an eye for detail.● Self-starter with a high level of drive and commitment.● High energy and drive to work in a startup environment.● Conceptual thinking, flexibility, and ability to juggle multiple responsibilities.● Ability to work under pressure and confidence to deal with complex issues.● Strong communication skills.● Hands-on and detail-oriented.",
      "Responsibilities": [],
      "Skills": [],
      "ApplyLink": "https://in.linkedin.com/jobs/view/react-developer-at-recro-4214197550?position=43&pageNum=0&refId=eDm74R%2FphOxzx1Og5Bg3%2Fw%3D%3D&trackingId=gWby7eGuILIQcirRlJfmgQ%3D%3D"
    }
  },
  {
    "id": 10,
    "Title": "Frontend Developer",
    "Company": "iRage",
    "Location": "Mumbai, Maharashtra, India",
    "Link": "https://in.linkedin.com/jobs/view/frontend-developer-at-irage-4211394457?position=45&pageNum=0&refId=eDm74R%2FphOxzx1Og5Bg3%2Fw%3D%3D&trackingId=wxaqMh0lGLLpgmVU2Zcykw%3D%3D",
    "Posted": "1 day ago",
    "DateTime": "2025-04-22",
    "Details": {
      "Description": "TechnologyLocation: Mumbai, IndiaWe are seeking a skilled React JS Developer to join our team, specializing in building and optimizing user interfaces for stock market trading applications. The ideal candidate will have experience in the financial domain, particularly in developing real-time, high-performance trading systems. You will work closely with traders, data analysts, and back-end developers to deliver cutting-edge, intuitive, and secure trading platforms.Key ResponsibilitiesDesign, develop, and maintain high-performance, scalable front-end applications for stock market trading.Collaborate with back-end developers, UX/UI designers, and product managers to create responsive and user-friendly interfaces.Optimize applications for maximum speed, scalability, and security, particularly when handling real-time financial data.Implement real-time data visualizations and charting using libraries such as Highcharts, TradingView, or similar tools.Build reusable components and front-end libraries for future use.Ensure cross-browser compatibility and responsiveness for a seamless user experience across various devices.Participate in code reviews, pair programming, and team meetings to maintain high-quality code and documentation.Debug and resolve performance issues, especially those related to real-time data processing and rendering.Stay up-to-date with the latest front-end technologies and best practices in the financial trading domain.Required Skills & ExperienceStrong proficiency in React.js and its core principles, including React hooks, Redux, and state management.Solid understanding of JavaScript (ES6+), HTML5, and CSS3.Experience with real-time data streaming, WebSockets, and RESTful APIs.Familiarity with financial charting libraries (e.g., Highcharts, TradingView, D3.js).Proficiency in modern front-end build pipelines and tools like Webpack, Babel, and NPM.Experience with version control systems like Git.Understanding of browser rendering behavior and performance optimization techniques.Experience working in Agile/Scrum development environments.Nice-to-Have SkillsPrior experience in the stock market or financial trading domain.Knowledge of back-end technologies (GoLang, Python) and database systems (SQL, NoSQL) is a plus.Understanding of algorithmic trading, order management systems (OMS), or risk management is an added advantage.Familiarity with cloud platforms (AWS, Azure) for deploying and scaling applications.QualificationsBachelor’s degree in Computer Science, Engineering, or a related field (or equivalent experience).3+ years of professional experience in React.js development (with financial services experience preferred).Apply Now!",
      "Responsibilities": [
        "Design, develop, and maintain high-performance, scalable front-end applications for stock market trading.Collaborate with back-end developers, UX/UI designers, and product managers to create responsive and user-friendly interfaces.Optimize applications for maximum speed, scalability, and security, particularly when handling real-time financial data.Implement real-time data visualizations and charting using libraries such as Highcharts, TradingView, or similar tools.Build reusable components and front-end libraries for future use.Ensure cross-browser compatibility and responsiveness for a seamless user experience across various devices.Participate in code reviews, pair programming, and team meetings to maintain high-quality code and documentation.Debug and resolve performance issues, especially those related to real-time data processing and rendering.Stay up-to-date with the latest front-end technologies and best practices in the financial trading domain."
      ],
      "Skills": [
        "Prior experience in the stock market or financial trading domain.Knowledge of back-end technologies (GoLang, Python) and database systems (SQL, NoSQL) is a plus.Understanding of algorithmic trading, order management systems (OMS), or risk management is an added advantage.Familiarity with cloud platforms (AWS, Azure) for deploying and scaling applications."
      ],
      "ApplyLink": "https://in.linkedin.com/jobs/view/frontend-developer-at-irage-4211394457?position=45&pageNum=0&refId=eDm74R%2FphOxzx1Og5Bg3%2Fw%3D%3D&trackingId=wxaqMh0lGLLpgmVU2Zcykw%3D%3D"
    }
  },
  {
    "id": 11,
    "Title": "Junior React JS Developer",
    "Company": "Winvesta",
    "Location": "Mumbai Metropolitan Region",
    "Link": "https://in.linkedin.com/jobs/view/junior-react-js-developer-at-winvesta-4211513466?position=47&pageNum=0&refId=eDm74R%2FphOxzx1Og5Bg3%2Fw%3D%3D&trackingId=EExojZOUkaIOjhGTo%2Fc1OQ%3D%3D",
    "Posted": "6 days ago",
    "DateTime": "2025-04-18",
    "Details": {
      "Description": "Apply only through the application form; other submissions risk being ignored, even if sent to senior team members, as our leadership team reviews applications daily.About WinvestaWinvesta is a rapidly growing fintech company on a mission to make cross-border payments and investing hassle-free and affordable for customers across India and the world. With its flagship product, the Global-Currency Account, Winvesta empowers individuals and businesses to conduct transactions on an international scale effortlessly.Winvesta was founded by Swastik Nigam, an IIM-A graduate and former Director at Deutsche Bank, London. He has 15 years of financial services experience in equities, ETFs, fixed income, currencies, and complex regulatory banking issues.Winvesta has earned numerous accreditations in its young tenure, including:Best Payment Solution 2023: BW Fintech AwardsBest Emerging Fintech 2023: Bharat Fintech SummitFinTech Company of the Year 2020 for the Asia Pacific by Barclays Entrepreneur.It is also a part of the prestigious London Mayor’s International Business Program.The company was also part of the Fintech Acceleration programs by Natwest and Hogan Lovells.The RoleWe're seeking a talented and enthusiastic Junior React JS Developer to join our development team.An Ideal Junior React JS Developer should have 1 to 2 years of experience in developing web applications using React JS.You will work under senior developers' guidance and be responsible for building user interface components and implementing them following well-known React.js workflows (such as Flux or Redux).Your ResponsibilitiesDevelop new user-facing features using React JS.Build reusable components and front-end libraries for future use.Translate designs and wireframes into high-quality code.Optimize components for maximum performance across a vast array of web-capable devices and browsers.Ensure the technical feasibility of UI/UX designs.Collaborate with other team members and stakeholders.RequirementsBachelor’s degree in Computer Science, Information Technology, or a related field.1-2 years of experience in React JS development.Strong proficiency in JavaScript, including DOM manipulation and the JavaScript object model.Thorough understanding of React.js and its core principles.Experience with popular React.js workflows (such as Flux or Redux).Familiarity with newer specifications of ECMAScript.Experience with data structure libraries (e.g., Immutable.js).Knowledge of isomorphic React is a plus.Familiarity with RESTful APIs.Knowledge of modern authorization mechanisms, such as JSON Web Token.Familiarity with modern front-end build pipelines and tools.Experience with common front-end development tools such as Babel, Webpack, NPM, etc.Ability to understand business requirements and translate them into technical requirements.A knack for benchmarking and optimization.Familiarity with code versioning tools such as Git.What Will Make You Great In This RoleStrong problem-solving skills.Excellent verbal and written communication skills.Attention to detail.Ability to work independently and in a team environment.Strong organizational skills and the ability to manage multiple tasks simultaneously.What You GetCompetitive salaryJoin a fast-paced and growing startup. This isn't your average 9 to 5 job.Opportunity to learn and grow with the company.Gain valuable knowledge and experience in fintech. You'll be ahead of the curve.At Winvesta, you will build with a global team of professionals who bring their deep expertise and a breadth of international experience in financial services. An exceptional board of advisors and investors will back you. You will be empowered to have autonomy in building and executing processes under guidance.Winvesta has created numerous firsts in Indian fintech. You will be a vital part of creating many more.Are you hungry?Skills: restful apis,redux,immutable.js,react.js,ecmascript,babel,dom manipulation,git,react,npm,javascript,webpack,json web token,flux,react js",
      "Responsibilities": [
        "Develop new user-facing features using React JS.Build reusable components and front-end libraries for future use.Translate designs and wireframes into high-quality code.Optimize components for maximum performance across a vast array of web-capable devices and browsers.Ensure the technical feasibility of UI/UX designs.Collaborate with other team members and stakeholders."
      ],
      "Skills": [],
      "ApplyLink": "https://in.linkedin.com/jobs/view/junior-react-js-developer-at-winvesta-4211513466?position=47&pageNum=0&refId=eDm74R%2FphOxzx1Og5Bg3%2Fw%3D%3D&trackingId=EExojZOUkaIOjhGTo%2Fc1OQ%3D%3D"
    }
  },
  {
    "id": 12,
    "Title": "Interesting Job Opportunity: Volody - Frontend Developer - React.js",
    "Company": "Volody",
    "Location": "Mumbai Metropolitan Region",
    "Link": "https://in.linkedin.com/jobs/view/interesting-job-opportunity-volody-frontend-developer-react-js-at-volody-4203492589?position=54&pageNum=0&refId=eDm74R%2FphOxzx1Og5Bg3%2Fw%3D%3D&trackingId=AN%2BH6fFyLns7QkKAbV5roA%3D%3D",
    "Posted": "2 weeks ago",
    "DateTime": "2025-04-08",
    "Details": {
      "Description": "Volody Product Pvt Ltd- Front end developer. Volody is an on-cloud enterprise software product Company providing AI-enabled Contract Lifecycle Management Software (Volody CLM) for businesses globally. We help legal functions to digitize & automate legal contract management processes using artificial intelligence tools, machine learning modules, and workflows. Volody CLM enables businesses to reduce contract execution time by 50%, saves cost, and enables paperless contract execution.Job ProfileVolody is looking out for a qualified Front-end developer to join the team. The candidate should be able to translate our company and customer needs into functional and appealing interactive applications.Job Responsibilities Ensure top-quality code by practicing code reviews, unit tests, integration tests, and end-to-end tests in a continuous integration environment Work closely with both product owners and back-end developers to fully understand business requirements and code. Create quality mockups and prototypes You can create a responsive webpage, creative web UI layout, Ai image, SVG Animation (Photoshop, CorelDraw, illustrator) Collaborate with back-end developers and web designers to improve usability Design the aesthetics to be implemented within a website or product, from the layout menus, drop-down options, etc. to colors and fonts Improve the look and feel of the website and productCandidate Profile Proven work experience as a Front-end developer Be familiar with ReactJS and its ecosystem. Past experience with React is a must. Use react.js, HTML5, CSS3 , and JavaScript ES5/ES6 Knowledge of front-end frameworks like Phalcon, React, Laravel. Should have experience with the software development process, optimization techniques, and testing methodologies. Experience in creating the best UX experience for customers. An ability to perform well in a fast-paced environment Excellent analytical and multitasking skills Ability to create user-friendly UI Prior internship/1 year experience as a Front-end developer. Continued education and research into UI trends and current design strategy and technology Familiarity with software like Adobe Suite, Photoshop and content management systems(ref:hirist.tech)",
      "Responsibilities": [
        "Ensure top-quality code by practicing code reviews, unit tests, integration tests, and end-to-end tests in a continuous integration environment Work closely with both product owners and back-end developers to fully understand business requirements and code. Create quality mockups and prototypes You can create a responsive webpage, creative web UI layout, Ai image, SVG Animation (Photoshop, CorelDraw, illustrator) Collaborate with back-end developers and web designers to improve usability Design the aesthetics to be implemented within a website or product, from the layout menus, drop-down options, etc. to colors and fonts Improve the look and feel of the website and product"
      ],
      "Skills": [
        "Sign in",
        "Welcome back",
        "Email or phone",
        "Password",
        "Show",
        "Forgot password?",
        "Sign in",
        "or",
        "By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement, Privacy Policy, and Cookie Policy.",
        "New to LinkedIn? Join now",
        "or",
        "New to LinkedIn? Join now",
        "By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement, Privacy Policy, and Cookie Policy."
      ],
      "ApplyLink": "https://in.linkedin.com/jobs/view/interesting-job-opportunity-volody-frontend-developer-react-js-at-volody-4203492589?position=54&pageNum=0&refId=eDm74R%2FphOxzx1Og5Bg3%2Fw%3D%3D&trackingId=AN%2BH6fFyLns7QkKAbV5roA%3D%3D"
    }
  },
  {
    "id": 13,
    "Title": "React Developer",
    "Company": "Arcitech",
    "Location": "Navi Mumbai, Maharashtra, India",
    "Link": "https://in.linkedin.com/jobs/view/react-developer-at-arcitech-4204060700?position=55&pageNum=0&refId=eDm74R%2FphOxzx1Og5Bg3%2Fw%3D%3D&trackingId=tJPfM646PyvDAkijBqAnGA%3D%3D",
    "Posted": "3 weeks ago",
    "DateTime": "2025-03-29",
    "Details": {
      "Description": "Arcot Group is on the lookout for a skilled React Developer to join our innovative development team. In this role, you will be responsible for building user-friendly and dynamic web applications using React.js. You will collaborate with designers and backend developers to create seamless, high-performance applications that provide an exceptional user experience. If you have a passion for front-end development and a strong foundation in React, we'd love to hear from you!Key ResponsibilitiesDeveloping and implementing user interface components using React.jsTranslating designs and wireframes into high-quality codeBuilding reusable components and front-end libraries for future useOptimizing components for maximum performance across a vast array of web-capable devices and browsersCollaborating with backend developers to integrate APIs and enhance application functionalityParticipating in code reviews and ensuring adherence to best practicesStaying updated with the latest industry trends and technologiesRequirementsBachelor's degree in Computer Science, Information Technology, or a related fieldProven experience as a React Developer or similar roleStrong proficiency in JavaScript, including ES6+ syntax and featuresExperience with state management libraries (e.g., Redux, Context API)Familiarity with RESTful APIs and asynchronous programmingUnderstanding of front-end development tools such as Webpack, Babel, and NPMExcellent problem-solving skills and ability to work collaboratively in a team environment",
      "Responsibilities": [
        "Developing and implementing user interface components using React.jsTranslating designs and wireframes into high-quality codeBuilding reusable components and front-end libraries for future useOptimizing components for maximum performance across a vast array of web-capable devices and browsersCollaborating with backend developers to integrate APIs and enhance application functionalityParticipating in code reviews and ensuring adherence to best practicesStaying updated with the latest industry trends and technologies"
      ],
      "Skills": [
        "Sign in",
        "Welcome back",
        "Email or phone",
        "Password",
        "Show",
        "Forgot password?",
        "Sign in",
        "or",
        "By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement, Privacy Policy, and Cookie Policy.",
        "New to LinkedIn? Join now",
        "or",
        "New to LinkedIn? Join now",
        "By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement, Privacy Policy, and Cookie Policy."
      ],
      "ApplyLink": "https://in.linkedin.com/jobs/view/react-developer-at-arcitech-4204060700?position=55&pageNum=0&refId=eDm74R%2FphOxzx1Og5Bg3%2Fw%3D%3D&trackingId=tJPfM646PyvDAkijBqAnGA%3D%3D"
    }
  },
  {
    "id": 14,
    "Title": "Frontend Developer",
    "Company": "Precize",
    "Location": "Mumbai, Maharashtra, India",
    "Link": "https://in.linkedin.com/jobs/view/frontend-developer-at-precize-4210855246?position=58&pageNum=0&refId=eDm74R%2FphOxzx1Og5Bg3%2Fw%3D%3D&trackingId=DD4qh6HHKD1rgHX1E3GNnw%3D%3D",
    "Posted": "1 week ago",
    "DateTime": "2025-04-17",
    "Details": {
      "Description": "Precize is seeking a skilled Front-End Developer to join our dynamic team. You will implement visual and interactive components in web applications using Next JS and Redux for state management, focusing on creating reusable, well-tested UI components while ensuring robustness and maintainability. Collaboration with cross-functional teams and proficiency in JavaScript (ES6+), HTML5, CSS3, React (hooks, state management), and testing frameworks (Jest, React Testing Library) is essential. A commitment to clean code, performance optimization, and seamless user experiences is key.Responsibilities:Develop user-facing features using Next js & Reacts js, ensuring they are robust, scalable, and high-performance.Build reusable components and front-end libraries that can be used across various projects to maintain code consistency and efficiency.Ensure the technical feasibility of UI/UX designs by working closely with the design team to translate designs into high-quality code.Optimize applications for maximum speed and scalability, focusing on delivering a seamless user experience.Implement responsive design techniques to ensure the application works flawlessly across different devices and screen sizes.Collaborate with product managers, designers, and backend developers to translate project requirements into functional, high-quality code.Ensure high-quality visual implementation by adhering to design guidelines and reviewing design specifications with the design team.Participate in agile development processes, including sprint planning, daily stand-ups, and retrospectives, to ensure efficient project delivery.Write clean, maintainable, and efficient code that adheres to best practices and coding standards.Conduct code reviews to ensure code quality, provide constructive feedback, and promote a culture of continuous improvement within the team.Troubleshoot and debug issues that arise during development, testing, and production, ensuring quick resolution and minimal impact on users.Ensure cross-browser compatibility by testing and resolving issues across various browsers and platforms.Stay updated on the latest front-end development trends, tools, and best practices to keep the team at the forefront of technology.Propose and implement improvements to the development processes, tools, and technologies to enhance productivity and code quality.Mentor junior developers, providing guidance and support to help them grow their skills and advance their careers.Qualifications:Bachelor’s degree in Computer Science, Information Technology, or a related field3+ years of relevant experience as a frontend developer.Proficiency in React, Next.js, TypeScript and JavaScript (ES6+). Experience in AWS is a plus. Knowledge about workflows in Git, Github, Figma, Postman and Cursor. Experience with Redux, Context API, Zustand or other state management libraries.Familiarity with RESTful APIs and third-party libraries ( React-hook-form, formik, etc ).Strong problem-solving skills and attention to detail for figma to code.Excellent communication and teamwork abilities.Ability to manage time effectively and handle complex tasks while maintaining code quality.",
      "Responsibilities": [],
      "Skills": [],
      "ApplyLink": "https://in.linkedin.com/jobs/view/frontend-developer-at-precize-4210855246?position=58&pageNum=0&refId=eDm74R%2FphOxzx1Og5Bg3%2Fw%3D%3D&trackingId=DD4qh6HHKD1rgHX1E3GNnw%3D%3D"
    }
  },
  {
    "id": 15,
    "Title": "Job Opening For React Frontend Developer",
    "Company": "BitByBit Solutions",
    "Location": "Mumbai, Maharashtra, India",
    "Link": "https://in.linkedin.com/jobs/view/job-opening-for-react-frontend-developer-at-bitbybit-solutions-4204915589?position=59&pageNum=0&refId=eDm74R%2FphOxzx1Og5Bg3%2Fw%3D%3D&trackingId=AK%2BFRFT0my7MssYM8qmMCw%3D%3D",
    "Posted": "2 weeks ago",
    "DateTime": "2025-04-10",
    "Details": {
      "Description": "Role Description Independent feature development of a stock trading application.  Fixing bugs raised by testing team.  Mentor junior whenever required.  Fixing live issue on priority.  Understanding of the Agile development life cycle.  Understanding of web development and server configuration.  Experience with optimizing application for material design. Specific Role ResponsibilitiesParticipate in the design, development and maintenance ofend-user app trading platform.       Determine, analyze and transform business requirements to produce design specifications at the system and programming levels.  Perform development on In-depth knowledge of JavaScript, CSS, HTML, and front-end languages and react tools like React.js, Webpack, Enzyme, Redux, and Flux .  Provide post-implementation support including analysis of production problems.  Exposure to enterprise, financial, trading processing systems will be preferred.  Good learner and self-starter, and a team player, ready for the next challenge - wherever it may be.  Good conceptual, analytical, mathematical skills. Skill Sets Education QualificationsBE/B.Tech/M.tech in any stream degree Competencies Required: (Behavioral Technical / Functional)         Experience of3-5 years mobile software development in ReactJs  Familiar with data structure, design pattern, Restful client-side API and OOPS concepts.  Good verbal and written communication skills  Must knowledge dart and flutter specific design pattern.  Have knowledge in iOS/Android apps developed with Flutter. Either deployed on the AppStore/Google Play or available on GitHub.  Ability to write readable code, create extensive documentation for existing code, and refactor the previously written code into readable state.  Experience with Git, Jenkins, or other version control tools. This job is provided by Shine.com",
      "Responsibilities": [
        "Determine, analyze and transform business requirements to produce design specifications at the system and programming levels.  Perform development on In-depth knowledge of JavaScript, CSS, HTML, and front-end languages and react tools like React.js, Webpack, Enzyme, Redux, and Flux .  Provide post-implementation support including analysis of production problems.  Exposure to enterprise, financial, trading processing systems will be preferred.  Good learner and self-starter, and a team player, ready for the next challenge - wherever it may be.  Good conceptual, analytical, mathematical skills."
      ],
      "Skills": [
        "Sign in",
        "Welcome back",
        "Email or phone",
        "Password",
        "Show",
        "Forgot password?",
        "Sign in",
        "or",
        "By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement, Privacy Policy, and Cookie Policy.",
        "New to LinkedIn? Join now",
        "or",
        "New to LinkedIn? Join now",
        "By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement, Privacy Policy, and Cookie Policy."
      ],
      "ApplyLink": "https://in.linkedin.com/jobs/view/job-opening-for-react-frontend-developer-at-bitbybit-solutions-4204915589?position=59&pageNum=0&refId=eDm74R%2FphOxzx1Og5Bg3%2Fw%3D%3D&trackingId=AK%2BFRFT0my7MssYM8qmMCw%3D%3D"
    }
  }
]